results/assets/load_testing_reports/07_imperative-quarkus-mongo-novt/8086_imperative-quarkus-mongo-novt.txt
errors.ETIMEDOUT: .............................................................. 2523
http.codes.200: ................................................................ 25904
http.codes.404: ................................................................ 60073
http.downloaded_bytes: ......................................................... 172073468
http.request_rate: ............................................................. 368/sec
http.requests: ................................................................. 88500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1638
  mean: ........................................................................ 64.9
  median: ...................................................................... 4
  p95: ......................................................................... 441.5
  p99: ......................................................................... 699.4
http.responses: ................................................................ 85977
vusers.completed: .............................................................. 85977
vusers.created: ................................................................ 88500
vusers.created_by_name.Get movies by id 1: ..................................... 30770
vusers.created_by_name.Get movies by id 2: ..................................... 31211
vusers.created_by_name.Get movies by page: ..................................... 17708
vusers.created_by_name.Save new movie: ......................................... 8811
vusers.failed: ................................................................. 2523
vusers.session_length:
  min: ......................................................................... 1
  max: ......................................................................... 2005.5
  mean: ........................................................................ 155
  median: ...................................................................... 4.4
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1720.2